In [1]:
import numpy as np
import pandas as pd
import random
import string

In [2]:
a = pd.Series(np.random.randint(1,5,100))
b = pd.Series(np.random.randint(1,4,100))
c = pd.Series(np.random.randint(10000,30000,100))

In [3]:
House= pd.concat ([a,b,c],axis=1)
House.head()

   0  1      2
0  3  1  27325
1  1  1  20514
2  4  3  25770
3  2  1  29940
4  4  2  21007

In [4]:
House.columns = ["bedrs","bathrs","price_sqr_meter"]
House.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            27325
1      1       1            20514
2      4       3            25770
3      2       1            29940
4      4       2            21007

In [5]:
bigcolumn = pd.concat ([a,b,c],axis=0)
bigcolumn.head()

0    3
1    1
2    4
3    2
4    4
dtype: int64

In [6]:
print (len(bigcolumn))

300

In [7]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

0          3
1          1
2          4
3          2
4          4
       ...
295    15269
296    27924
297    24436
298    22372
299    13741
Length: 300, dtype: int64